---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipePressureDropService
source: html/fc160a77-9b51-6df5-a4e3-bf3f16ec3a8c.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipePressureDropService Property

The external service which permits registration of an alternate implementation for pipe pressure drop calculation.
 To use this service, programmers implement a server class that derives from IPipePressureDropServer .

## Syntax (C#)
```csharp
public static ExternalServiceId PipePressureDropService { get; }
```